Enables Auto-detect on Sketch Component.
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public void EnableAutoDetect()
  Visual Basic
Public Sub EnableAutoDetect
  Visual C++
public:
void EnableAutoDetect()
 Remarks
 To disable Auto-detect on Sketch Component, another method (SetAnalyticalAlignmentMethod) must be used
 See Also
  AnalyticalModelSketchComponent Class
  Autodesk.Revit.DB.Structure Namespace